<template>
    <article ref="Article">
        <div><b>前言</b>
            <p>橋牌是一個打牌和叫牌都很重要的遊戲。對我而言，叫牌又是特別地引人入勝。叫牌的規則很少，大概只有花色與NT的大小順序、不能叫超過7線，Double、Redouble等等的簡易規則。本文介紹的是「約定」，不是「規則」。原則上，想怎麼約定都行，而本文是提供學習者（尤其是臺大醫學院橋藝社社員）一個入門用的制度，簡單而強大，提供一個良好的基礎，並希望讀者能喜歡上橋牌這個遊戲。</p>
        </div>
        <div><h2>開叫</h2>
            <table class="bidtable">
                <tr>
                    <th colspan="2">開叫</th>
                </tr>
                <tr>
                    <td><a href="#1C">1!C</a></td>
                    <td>平均牌2張以上梅花，12-14點或18-19點；非平均牌4張以上梅花，12-21點。</td>
                </tr>
                <tr>
                    <td><a href="#1D">1!D</a></td>
                    <td>4張以上方塊。平均牌12-14點或18-19點；非平均牌12-21點。</td>
                </tr>
                <tr>
                    <td>1!H/!S</td>
                    <td>5張以上，12-21。</td>
                </tr>
                <tr>
                    <td>1NT</td>
                    <td>15-17，平均牌型，沒有5張高花。</td>
                </tr>
                <tr>
                    <td>2!C</td>
                    <td>強牌迫叫。</td>
                </tr>
                <tr>
                    <td>2NT</td>
                    <td>20-21平均牌型，可能有5張高花。</td>
                </tr>
            </table>
            <ul>
                <li>12點以上必定要開叫。開叫不是單指叫牌，而是指如果有順序在前的玩家，都Pass以後，輪到自己的這個情況下。</li>
                <li>22點以上的牌，都以2!C開叫。12-21點的牌，請參閱以下說明。</li>
                <li>以開叫最長的花色為原則，不過我們規定!S/!H要5張以上、!D要4張以上才可以開叫。</li>
                <li>如果拿5張!C/!D，或沒有5張花色的手牌，此時可能是「平均牌型」。「平均牌型」指5332、4432、4333這三種牌型，應依照對應的點力範圍選擇叫品。
                    <ul>
                        <li>12-14。開叫1!C/1!D</li>
                        <li>15-17。開叫1NT</li>
                        <li>18-19。開叫1!C/1!D</li>
                        <li>20-21。開叫2NT</li>
                    </ul>
                    事實上，點力範圍的設計就是交叉使用，並且前兩個的範圍是三個點，而後兩個的範圍是2個點。
                </li>
                <li>未滿12點時，開叫是以「擾亂對手」為本質。見下方。</li>
            </ul>
            <table class="bidtable">
                <tr>
                    <th colspan="2">竄叫（又稱阻塞叫，即擾亂性叫牌）</th>
                </tr>
                <tr>
                    <td>2!D/!H/!S</td>
                    <td>6張以上的!D/!H/!S。通常約6-9點。</td>
                </tr>
                <tr>
                    <td>3!C/!D/!H/!S</td>
                    <td>7張以上的!C/!D/!H/!S。通常約6-9點。</td>
                </tr>
                <tr>
                    <td>4!C/!D/!H/!S</td>
                    <td>8張以上的!C/!D/!H/!S。通常約6-9點。</td>
                </tr>
            </table>
            <ul>
                <li>竄叫時，點力通常較集中在竄叫的花色中。</li>
                <li>可參考「二、三定律」
                    <ul>
                        <li>在我方有身價時（叫牌盒方位的底色是紅色），而對方無身價（叫牌盒方位的底色是綠色）時，以倒兩墩為目標竄叫。</li>
                        <li>其他情形以倒三墩為目標竄叫。</li>
                    </ul>
                </li>
            </ul>
        </div>
        <div><h2>低花開叫的後續</h2>
            <table class="bidtable" id="1C">
                <tr>
                    <th>1!C</th>
                    <th>2張以上梅花，12-21點。</th>
                </tr>
                <tr>
                    <td>1!D</td>
                    <td>6點以上，通常4張以上方塊。如果有4張高花而點力不滿12點時，先叫4張高花。</td>
                </tr>
                <tr>
                    <td><a href="#1C-1H">1!H</a></td>
                    <td>6點以上，4張以上紅心。</td>
                </tr>
                <tr>
                    <td>1!S</td>
                    <td>6點以上，4張以上黑桃。</td>
                </tr>
                <tr>
                    <td>1NT</td>
                    <td>6-9(10)點，沒有一門4張以上的!H或!S。</td>
                </tr>
                <tr>
                    <td>2!C</td>
                    <td>11點以上。5張以上梅花支持，沒有4張以上高花。邀請，迫叫到3!C。</td>
                </tr>
                <tr>
                    <td>2NT</td>
                    <td>10-11(12)點，沒有一門4張以上的!H或!S。</td>
                </tr>
            </table>
            <p>1!D開叫的答叫叫品，主要是多了一個2!C迫叫成局的叫品。</p>
            <table class="bidtable" id="1D">
                <tr>
                    <th>1!D</th>
                    <th>4張以上方塊，12-21點。</th>
                </tr>
                <tr>
                    <td>1!H</td>
                    <td>6點以上，4張以上紅心。</td>
                </tr>
                <tr>
                    <td>1!S</td>
                    <td>6點以上，4張以上黑桃。</td>
                </tr>
                <tr>
                    <td>1NT</td>
                    <td>6-9(10)點，沒有一門4張以上的!H或!S。</td>
                </tr>
                <tr>
                    <td>2!C</td>
                    <td>12點以上，迫叫成局。5張以上梅花牌組。</td>
                </tr>
                <tr>
                    <td>2!D</td>
                    <td>11點以上。4張以上方塊支持，沒有4張以上高花。邀請，迫叫到3!D。</td>
                </tr>
                <tr>
                    <td>2NT</td>
                    <td>10-11(12)點，沒有一門4張以上的!H或!S。</td>
                </tr>
            </table>
            <ul>
                <li>低花開叫後答叫一樣以叫出最長花色為原則。但有幾個例外：
                    <ul>
                        <li>沒有迫叫成局的點力時：
                            <ul>
                                <li>有4張高花（!H/!S）的時候，應忽略掉更長的!D。</li>
                                <li>不能「二蓋一」（這裡只有1!D後叫2!C一個情形）。</li>
                            </ul>
                        </li>
                        <li>當最長的花色與開叫的花色相同時，如果有4張高花，也應先叫4張高花。否則進行「低花反序」（弱的叫得多，強的叫得少），並要注意張數的最低限制：
                            <ul>
                                <li>叫二線要有邀請以上（好的10點以上）的力量，叫三線要有7-9點（或壞的10點）的力量。</li>
                                <li>1!C後面叫二線要有五張!C；三線要有六張!C。</li>
                                <li>1!D後面叫二線要有四張!D；三線要有五張!D。</li>
                            </ul>
                        </li>
                    </ul>
                </li>
                <li>選擇叫高花時，若有兩門以上4張高花時，叫張數較多的花色。張數一樣多時，皆為4張時叫1!H；皆為5張或以上時，叫1!S。</li>
                <li>無叫品可叫時（不能叫4張高花，不能叫低花反序，不能叫出沒叫過的低花時），依照點力叫NT的叫品</li>
            </ul>
            <div><h3>答叫高花以後：1m-1M</h3>
                <table class="bidtable" id="1C-1H">
                    <tr>
                        <th><a href="#1C">1!C</a></th>
                        <th>1!H</th>
                        <th>6點以上，4張以上紅心。</th>
                    </tr>
                    <tr>
                        <td colspan="2">1!S</td>
                        <td>沒有4張以上紅心（＝沒配合），有4張以上黑桃，12-19點。</td>
                    </tr>
                    <tr>
                        <td colspan="2">1NT</td>
                        <td>沒有4張以上紅心，12-14點，通常是平均牌型。</td>
                    </tr>
                    <tr>
                        <td colspan="2">2!C</td>
                        <td>沒有4張以上紅心，5張以上梅花（通常6張以上），12-15點。</td>
                    </tr>
                    <tr>
                        <td colspan="2">2!H</td>
                        <td>4張以上紅心支持，12-15點。</td>
                    </tr>
                    <tr>
                        <td colspan="2">2NT</td>
                        <td>沒有4張以上紅心，18-19點，平均牌型。</td>
                    </tr>
                    <tr>
                        <td colspan="2">3!C</td>
                        <td>沒有4張以上紅心，6張以上梅花，16-18點。</td>
                    </tr>
                    <tr>
                        <td colspan="2">3!H</td>
                        <td>4張以上紅心支持，16-17(18)點。</td>
                    </tr>
                    <tr>
                        <td colspan="2">4!H</td>
                        <td>4張以上紅心支持，18點以上。</td>
                    </tr>
                </table>
                <table class="bidtable">
                    <tr>
                        <th colspan="2">1!C-1!H 後續非平均的強力叫品</th>
                    </tr>
                    <tr>
                        <td>2!D</td>
                        <td>「倒叫」16點以上，通常4張以上方塊，沒有4張紅心。迫叫一圈且保證再叫。</td>
                    </tr>
                    <tr>
                        <td>2!S</td>
                        <td>「強跳叫」19點以上，4張以上黑桃，沒有4張紅心。迫叫成局。</td>
                    </tr>
                    <tr>
                        <td>3!D</td>
                        <td>「Splinter」19點以上，4張以上紅心支持，方塊短門（一張以下），迫叫成局。</td>
                    </tr>
                    <tr>
                        <td>3!S</td>
                        <td>「Splinter」19點以上，4張以上紅心支持，方塊短門（一張以下），迫叫成局。</td>
                    </tr>
                </table>
                <p>1m-1M的後續都很相似。</p>
                <ul>
                    <li>有4張的高花支持
                        <ul>
                            <li>依照點力的範圍決定要如何支持（2!H/3!H/4!H）</li>
                            <li>極強（19+）的非平均牌情況叫「Splinter」特約叫品</li>
                        </ul>
                    </li>
                    <li>無4張的高花支持
                        <ul>
                            <li>平均牌型：叫1NT（12-14點）、2NT（18-19點）</li>
                            <li>非平均牌型：有另一門4張以上的牌組
                                <ul>
                                    <li>在1線叫出新花色：12-19點，4張以上。</li>
                                    <li>在2線叫出新花色，新花色低於第一次叫的花色（例如1!D-1M-2!C）：12-17點，4張以上。</li>
                                    <li>在2線叫出新花色，新花色高於第一次叫的花色，而且沒辦法在1線叫出該花色（例如1!C-1M-2!D）：16點以上，迫叫一圈。</li>
                                    <li>在2線叫出新花色，新花色高於第一次叫的花色，而且可以在1線叫出該花色（例如1!C-1!H-2!S）：19點以上，迫叫成局。</li>
                                </ul>
                            </li>
                            <li>非平均牌型：沒有另一門4張以上的牌組
                                <ul>
                                    <li>2線重新叫一次開叫的牌組：12-15點</li>
                                    <li>3線重新叫一次開叫的牌組：16-18點</li>
                                </ul>
                            </li>
                        </ul>
                    </li>
                </ul>
            </div>
            <div><h3>再叫1NT以後：1m-1M-1NT</h3>
                <table class="bidtable">
                    <tr>
                        <th></th>
                        <th colspan="2">1m</th>
                    </tr>
                    <tr>
                        <th>1M</th>
                        <th>1NT</th>
                        <th>沒有4張M支持，12-14平均牌型。</th>
                    </tr>
                    <tr>
                        <td colspan="2">2m</td>
                        <td>建議打2m合約，低限的點力。</td>
                    </tr>
                    <tr>
                        <td colspan="2">2om</td>
                        <td>「新低花迫叫」邀請以上，迫叫一圈。</td>
                    </tr>
                    <tr>
                        <td colspan="2">2M</td>
                        <td>5張以上的高花，6-9點。</td>
                    </tr>
                    <tr>
                        <td colspan="2">2oM</td>
                        <td><ul>
                            <li>如果是!S：4張以上!S，12點以上，迫叫成局。</li>
                            <li>如果是!H：5張!S，4張以上!H，6-9點不迫叫。</li>
                        </ul></td>
                    </tr>
                    <tr>
                        <td colspan="2">2NT</td>
                        <td>偏向平均牌型，10-11點，邀請。</td>
                    </tr>
                    <tr>
                        <td colspan="2">3m</td>
                        <td>足夠張數的低花支持，10-11點，邀請。</td>
                    </tr>
                    <tr>
                        <td colspan="2">3M</td>
                        <td>6張以上高花支持，10-11點，邀請。</td>
                    </tr>
                    <tr>
                        <td colspan="2">3NT</td>
                        <td>12-17(18)點。</td>
                    </tr>
                </table>
            </div>
        </div>
    </article>
</template>
<script>
export default {
  mounted() {
    this.$root.replaceSuitSigns(this.$refs.Article);
    this.$root.genTOC();
    this.$root.$data.topic = "Tự Nhiên Chế";
  }
}
</script>
<style scoped>

</style>